src/DataProcessors/МастерВводаДанных/МастерВводаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
	<name>МастерВводаДанных</name>
	<attributes>
		<name>ДанныеБуфера</name>
		<type>
			<types>String</types>
		</type>
	</attributes>
	<attributes>
		<name>Кассир</name>
		<type>
			<types>CatalogRef.Кассир</types>
		</type>
	</attributes>
	<attributes>
		<name>ПутьКФайлу</name>
		<type>
			<types>String</types>
			<stringQualifiers>
				<length>50</length>
			</stringQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>ТабличныйДокумент</name>
		<type>
			<types>SpreadsheetDocument</types>
		</type>
	</attributes>
	<attributes>
		<name>Курс</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>10</precision>
				<scale>3</scale>
			</numberQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>Валюта</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</attributes>
	<attributes>
		<name>ВзаиморасчетыВедутся</name>
		<type>
			<types>Boolean</types>
		</type>
	</attributes>
	<attributes>
		<name>ФлагНажатия</name>
		<type>
			<types>Boolean</types>
		</type>
	</attributes>
	<tabularSections>
		<name>ОтчетПоБилетам</name>
		<attributes>
			<name>_АГН</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>10</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>_СУБ</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>10</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>СУБАГЕНТ</name>
			<type>
				<types>CatalogRef.Кассир</types>
			</type>
		</attributes>
		<attributes>
			<name>PNR</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>15</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>АВК</name>
			<type>
				<types>CatalogRef.Авиакомпания</types>
			</type>
		</attributes>
		<attributes>
			<name>_БИЛЕТА</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>15</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>ДАТАПРОД_</name>
			<type>
				<types>Date</types>
				<dateQualifiers>
					<dateFractions>Date</dateFractions>
				</dateQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>ДАТАВЫЛ_</name>
			<type>
				<types>Date</types>
				<dateQualifiers>
					<dateFractions>Date</dateFractions>
				</dateQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>Направление</name>
			<type>
				<types>CatalogRef.Направления</types>
			</type>
		</attributes>
		<attributes>
			<name>Итого</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>10</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>АГС</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>АГЕНСТВО</name>
			<type>
				<types>CatalogRef.Агенство</types>
			</type>
		</attributes>
		<attributes>
			<name>АГН</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>10</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>АГНИТОГ</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>10</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>СУБИТОГ</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>10</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>Примечание</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>40</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>СУБ</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>10</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>ПУЛЬТ</name>
			<type>
				<types>CatalogRef.Пульт</types>
			</type>
		</attributes>
		<attributes>
			<name>АГНИСП</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>20</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>СУБИСП</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>20</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>Валюта</name>
			<type>
				<types>CatalogRef.Валюта</types>
			</type>
		</attributes>
		<attributes>
			<name>ВАЛ_ВЗАИМ</name>
			<type>
				<types>CatalogRef.Валюта</types>
			</type>
		</attributes>
		<attributes>
			<name>КУРС</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>3</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>ТАРИФ</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>3</scale>
				</numberQualifiers>
			</type>
		</attributes>
	</tabularSections>
</mdclass:DataProcessor>

src/DataProcessors/МастерВводаДанных/Forms/ВыборКассира/Module.bsl
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Если Объект.Кассир=Неопределено ИЛИ Объект.Курс=0 Тогда	
	Предупреждение("Поле Кассир или Курс не заполнены",10,"Не заполнены поля");
	    
Иначе
	МассивЗначений=Новый Массив;
	МассивЗначений.Добавить(Объект.Кассир);
	МассивЗначений.Добавить(Объект.Курс);
	МассивЗначений.Добавить(Объект.ВзаиморасчетыВедутся);
	Оповестить("ПередачаКассира",МассивЗначений);
	ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
Флаг=УстановкаВалюты(Параметры.ВалютаВзаиморасчетов);
Если Флаг Тогда
	Элементы.Курс.ТолькоПросмотр=Истина;
	Элементы.ВзаиморасчетыВедутся.ТолькоПросмотр=Истина;
	Объект.ВзаиморасчетыВедутся=Истина;
КонецЕсли;
КонецПроцедуры

&НаСервере 
Функция УстановкаВалюты(Валюта)
	ДанныеФормы=РеквизитФормыВЗначение("Объект");
	ФлагВозврата=Ложь;
	Если Валюта=Справочники.Валюта.НайтиПоНаименованию("TJS") Тогда
		ДанныеФормы.Курс=1;
		ДанныеФормы.Валюта=Валюта;
		ФлагВозврата=Истина;
	Иначе
		ДанныеФормы.Валюта=Валюта;
	КонецЕсли;
ЗначениеВРеквизитФормы(ДанныеФормы,"Объект");
Возврат ФлагВозврата;
КонецФункции

&НаКлиенте
Процедура ВзаиморасчетыВедутсяПриИзменении(Элемент)
	Если Объект.ВзаиморасчетыВедутся Тогда
		Объект.Курс=1;
		Элементы.Курс.ТолькоПросмотр=Истина;
	Иначе
		Объект.Курс=0;
		Элементы.Курс.ТолькоПросмотр=Ложь;
	КонецЕсли;
КонецПроцедуры
